MemorialProjectConfigs/src/main/synapse-config/sequences/callEndpointSequence.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="callEndpointSequence" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <payloadFactory media-type="xml">
        <format>
            <soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <soap12:Body>
                    <Add xmlns="http://tempuri.org/">
                        <intA>$1</intA>
                        <intB>$2</intB>
                    </Add>
                </soap12:Body>
            </soap12:Envelope>
        </format>
        <args>
            <arg evaluator="xml" expression="get-property('number1')"/>
            <arg evaluator="xml" expression="get-property('number2')"/>
        </args>
    </payloadFactory>
    <send>
        <endpoint>
            <address format="soap12" uri="http://www.dneonline.com/calculator.asmx">
                <suspendOnFailure>
                    <initialDuration>-1</initialDuration>
                    <progressionFactor>-1</progressionFactor>
                    <maximumDuration>0</maximumDuration>
                </suspendOnFailure>
                <markForSuspension>
                    <retriesBeforeSuspension>0</retriesBeforeSuspension>
                </markForSuspension>
            </address>
        </endpoint>
    </send>
</sequence>
